ASK_NAME_MSG = (
    'Напиши название для растения. '
    'Оно будет отображаться в твоем списке растений.'
)
NO_TEXT_NAME_MSG = (
    'Пожалуйста, отправь текстовое сообщение с названием растения.'
)
NOT_UNIQUE_NAME_MSG = (
    'Растение с таким именем уже есть в базе. '
    'Попробуй внести другое название.'
)
ASK_DESCRIPTION_MSG = 'Название получено. Напиши короткое описание.'
NO_TEXT_DESCRIPTION_MSG = (
    'Пожалуйста, отправь текстовое сообщение с описанием растения.'
)
ASK_PHOTO_MSG = 'Описание получено. Отправь фото растения.'
NO_PHOTO_MSG = 'Пожалуйста, отправь только фото растения.'
ASK_WARM_PERIOD_START_MSG = (
    'Фото получено. '
    'Пожалуйста, отправь текстовое сообщение с датой начала '
    'теплого периода в формате ДД-ММ'
)
NO_TEXT_WARM_PERIOD_START_MSG = (
    'Пожалуйста, отправь текстовое сообщение с датой начала '
    'теплого периода в формате ДД-ММ'
)
INCORRECT_DATE_FORMAT_MSG = (
    '❌ Неверный формат даты. Введи дату в формате ДД-ММ, например: 15-04.'
)
ASK_WARM_PERIOD_END_MSG = (
    'Дата начала теплого периода получена. '
    'Напиши дату окончания теплого периода в формате ДД-ММ.'
)
NO_TEXT_WARM_PERIOD_END_MSG = (
    'Пожалуйста, отправь текстовое сообщение с датой окончания '
    'тёплого периода в формате ДД-ММ.'
)
INVALID_END_DATE_MSG = (
    '⚠️ Дата окончания не может быть раньше даты начала. '
    'Попробуй снова ввести корректную дату окончания.'
)
ASK_WATERING_FREQUENCY_WARM_MSG = (
    'Дата окончания тёплого периода получена. '
    'Теперь введи частоту полива (например, по неделям, по месяцам).'
)
ASK_FERTILIZING_PERIOD_START_MSG = (
    'Пожалуйста, отправь текстовое сообщение с датой начала '
    'подкормок в формате ДД-ММ.'
)
NO_TEXT_FERTILIZING_START_MSG = (
    'Пожалуйста, отправь текстовое сообщение с датой начала '
    'подкормок в формате ДД-ММ.'
)
ASK_FERTILIZING_PERIOD_END_MSG = (
    'Дата начала подкормок получена. '
    'Напиши дату окончания подкормок в формате ДД-ММ.'
)
NO_TEXT_FERTILIZING_END_MSG = (
    'Пожалуйста, отправь текстовое сообщение с датой окончания '
    'подкормок в формате ДД-ММ.'
)
ASK_FERTILIZING_FREQUENCY_MSG = (
    'Дата окончания подкормок получена. '
    'Теперь введи частоту подкормок (в днях, в неделях).'
)
ASK_FERTILIZING_INTERVAL_MESSAGE = (
    '🗓️ Введи, как часто удобрять растение (через сколько *{interval}*):'
)
SELECTED_DAYS_MSG = '✅ Вы выбрали дни: {days_str}'
ASK_COLD_PERIOD_FREQ_MSG = (
    'Теперь выбери частоту полива для холодного периода:'
)
SELECTED_DAY_MSG = '✅ День полива: {day_str}'
