INVALID_FERTILIZING_INTERVAL_VALUE_MSG = 'Введи положительное число.'
PLANT_ADDED_MSG = 'Растение добавлено.'


NO_DAYS_CHOSEN_MSG = 'Выбери хотя бы один день!'
SELECTED_DAYS_MSG = '✅ Вы выбрали дни: {days}'

ASK_WATERING_FREQUENCY_COLD_MSG = (
    'Теперь выбери частоту полива для холодного периода:'
)

ASK_FERTILIZING_START_MSG = (
    'Пожалуйста, отправь текстовое сообщение с датой начала '
    'подкормок в формате ДД-ММ.'
)
SELECTED_DAY_MSG = '✅ День полива: {day_str}'
ASK_COLD_PERIOD_FREQUENCY_MSG = (
    'Теперь выбери частоту полива для холодного периода'
)
INVALID_DAY_OF_MONTH_MSG = '❌ Число должно быть от 1 до 31.'
NO_TEXT_DAY_OF_MONTH_MSG = '❌ Введи число от 1 до 31.'

NO_PLANTS_MESSAGE = 'Пока ничего не отслеживается.'
DELETION_CANCELED_MESSAGE = 'Удаление отменено.'
CHECK_ONE_CANCELED_MESSAGE = 'Просмотр статистики отменен.'
PLANT_DELETED_MESSAGE = 'Растение "{plant_name}" удалено.'
ERROR_MESSAGE = 'Произошла ошибка. Попробуйте начать сначала.'
NO_MESSAGE_ERROR = 'Ошибка: сообщение недоступно.'
PLANT_NOT_FOUND_MESSAGE = '⚠️ Растение с именем «{plant_name}» не найдено.'
PLANT_INFO_LINE = '{pos}. {name}\n🚿: {watering}. 🌿: {fertilizing}'
RUBLE_PRICE_LINE_INFO = 'Примерно {rub_price} рублей'
USER_NOT_RECOGNIZED = 'Не удалось определить пользователя 🚫'
START_MESSAGE = (
    'Привет, {name}!\n'
    'Этот бот мониторит цены на товары на следующих сайтах: \n {sites}'
)

ITEMS_PER_PAGE = 10
PREV_PAGE_BUTTON = '⬅️ Назад'
NEXT_PAGE_BUTTON = '➡️ Вперёд'
PAGINATION_MESSAGE = (
    'Выберите растение для удаления (стр. {current_page} / '
    '{pages}):\n\n'
    '{lines}'
)
PAGINATION_MESSAGE_INFO = (
    'Выберите растение для просмотра информации (стр. {current_page} / '
    '{pages}):\n\n'
    '{lines}'
)
JOB_ID = 'Watering notifications'
RUB_LINE = '💵 Примерно <b>{rub_price} ₽</b>\n'
UPDATE_PRICE_MESSAGE = (
    '💰 Цена на <b>{product}</b> обновилась: <b>{new_price}</b>\n'
    '{rub_line}\n'
    '📉 Минимальная цена за период: <b>{min_price}</b>\n'
    '📈 Максимальная цена за период: <b>{max_price}</b>\n\n'
    '🕒 Наблюдение начато: <b>{created_at}</b>\n'
    '📅 Последнее обновление: <b>{updated_at}</b>\n\n'
    '🔗 <a href="{url}">Перейти на сайт</a>'
)
PRICE_INFO_MESSAGE = (
    '💰 Цена на <b>{product}</b>: <b>{new_price}</b>\n'
    '{rub_line}\n'
    '📉 Минимальная цена за период: <b>{min_price}</b>\n'
    '📈 Максимальная цена за период: <b>{max_price}</b>\n\n'
    '🕒 Наблюдение начато: <b>{created_at}</b>\n'
    '📅 Последнее обновление: <b>{updated_at}</b>\n\n'
    '🔗 <a href="{url}">Перейти на сайт</a>'
)

WATERING_SCHEDULED_MESSAGE = 'Пришло время полить{fert} растение <b>{name}</b>'
DELETE_CANCELED_MSG = 'Удаление отменено'
CHECK_CANCELED_MSG = 'Просмотр информации отменен.'
